app/controllers/devise_api/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."jti" = $1 LIMIT $2  [["jti", "df9df675-4d18-4a7c-a5f6-e24ba308bdcb"], ["LIMIT", 1]]
---
    def destroy
      if request.headers["Authorization"].blank?
        render json: {error: "Authorization param needed!"}
        return
      end
      user = ApiUser.find_by_jti(decode_token)

UPDATE "users" SET "jti" = $1 WHERE "users"."id" = $2  [["jti", "9b0864dd-63df-4b27-b6b4-b219b06f60dc"], ["id", 1]]
---
    def revoke_token(user)
      user.update_column(:jti, generate_jti)