app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."jti" = $1 LIMIT $2  [["jti", "dd722993-5d8e-48bb-9ba4-c3b74e222ad4"], ["LIMIT", 1]]
---
    def set_current_user
      puts ApiUser.find_by_jti(decode_token)
      @current_user ||= User.find_by_jti(decode_token)