app/controllers/coffee_shops_controller.rb

    def create
        if params[:coffee_shop].blank? || params[:coffee_shop][:name].blank? ||
            params[:coffee_shop][:address].blank? || params[:coffee_shop][:owner_id].blank?
            raise ErrorHandling::Errors::CoffeeShop::CreationParams.new({params: params})
        end
        coffee_shop = CoffeeShop.new (coffee_shop_params)
        authorize coffee_shop
        coffee_shop.creator = current_user
        if coffee_shop.save
---
SELECT  1 AS one FROM "coffee_shops" WHERE LOWER("coffee_shops"."name") = LOWER($1) LIMIT $2  [["name", "coffeeShopName"], ["LIMIT", 1]]
INSERT INTO "coffee_shops" ("name", "address", "owner_id", "creator_id", "created_at", "updated_at", "maintainer_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        if params[:coffee_shop].blank? || params[:coffee_shop][:name].blank? ||
            params[:coffee_shop][:address].blank? || params[:coffee_shop][:owner_id].blank? ||
            params[:coffee_shop][:maintainer_id].blank?
            raise ErrorHandling::Errors::CoffeeShop::UpdateParams.new({params: params})
        end

        coffee_shop = CoffeeShop.find(params[:id])
        authorize coffee_shop

        coffee_shop.update(coffee_shop_params)
---
SELECT  1 AS one FROM "coffee_shops" WHERE LOWER("coffee_shops"."name") = LOWER($1) AND "coffee_shops"."id" != $2 LIMIT $3  [["name", "new_name"], ["id", 552], ["LIMIT", 1]]
SELECT  "coffee_shops".* FROM "coffee_shops" WHERE "coffee_shops"."id" = $1 LIMIT $2  [["id", 552], ["LIMIT", 1]]
UPDATE "coffee_shops" SET "owner_id" = $1, "maintainer_id" = $2, "name" = $3, "address" = $4, "updated_at" = $5 WHERE "coffee_shops"."id" = $6  [["owner_id", 10170], ["maintainer_id", 10169], ["name", "new_name"], ["address", "new_address"], ["updated_at", "2019-10-21 11:18:24.392170"], ["id", 560]]

    def deactivate
        coffee_shop = CoffeeShop.find(params[:id])
---
SELECT  "coffee_shops".* FROM "coffee_shops" WHERE "coffee_shops"."id" = $1 LIMIT $2  [["id", 555], ["LIMIT", 1]]