app/controllers/users_controller.rb

    def create

        if params[:user].blank? || params[:user][:email].blank? || params[:user][:password].blank? || params[:user][:role].blank?
            raise ErrorHandling::Errors::User::CreationParams.new({params: params})
        end

        user =User.new(user_params)
        authorize user
        if user.save
---
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test07@test.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "jti", "role") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
        if params[:user].blank?|| params[:user][:email].blank? | params[:user][:password].blank? || params[:user][:role].blank?
            raise ErrorHandling::Errors::User::UpdateParams.new({params: params})
        end

        user = User.find(params[:id])
        authorize user
        if user.update(user_params)
---
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 AND "users"."id" != $2 LIMIT $3  [["email", "test17@test.com"], ["id", 14], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "encrypted_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "test27@test.com"], ["encrypted_password", "$2a$11$V.v96ezRb1oZ9pudXgffbu5bJZDvwxrB8oaRc2Dev64PeAKNJHoOG"], ["updated_at", "2019-10-07 07:10:56.282279"], ["id", 14]]

    def deactivate
        user = User.find(params[:user_id])
        authorize user

        if user.deleted_at?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 14]]