app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 14]]
---
    def destroy
        user = User.find(params[:id])
        authorize user
        if user.deleted_at?