app/controllers/users_controller.rb

    def update
        if params[:user].blank?|| params[:user][:email].blank? | params[:user][:password].blank? || params[:user][:role].blank?
            raise ErrorHandling::Errors::User::UpdateParams.new({params: params})
        end

        user = User.find(params[:id])
        authorize user
        if user.update(user_params)
---
UPDATE "users" SET "role" = $1, "email" = $2, "encrypted_password" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["role", 3], ["email", "new@test"], ["encrypted_password", "$2a$04$WB9xYvFH90JcJQcP14ymyujlZQPLp/gU4B3iLlIHtwOv8DGFsoV5K"], ["updated_at", "2019-10-16 07:12:40.883435"], ["id", 7210]]